app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title 1"], ["description", "desc 1"], ["created_at", "2017-03-01 17:12:54.142541"], ["updated_at", "2017-03-01 17:12:54.142541"]]
---
  def create
    @post=Post.create(title:params[:post][:title], description:params[:post][:description])